---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.HasValidConfiguration
source: html/dc0b2e19-bd72-b15d-3752-a2ea09938b7c.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.HasValidConfiguration Method

Checks whether a valid fabrication configuration has been set for the project.

## Syntax (C#)
```csharp
public bool HasValidConfiguration()
```

## Returns
True if a valid fabrication configuration has been set for the project.